fediverse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Fediverse and Mastadon</title>
<!-- 2019-11-19 Tue 11:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Bradley Small" />
</head>
<body>
<div id="content">
<h1 class="title">The Fediverse and Mastadon</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Social Media</a>
<ul>
<li><a href="#sec-1-1">1.1. Why do people use it (Top 10 from Pew)</a></li>
<li><a href="#sec-1-2">1.2. Why people avoid it</a></li>
<li><a href="#sec-1-3">1.3. Why do businesses use it</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Silos</a></li>
<li><a href="#sec-3">3. Federated Alternatives</a>
<ul>
<li><a href="#sec-3-1">3.1. Protocols</a></li>
<li><a href="#sec-3-2">3.2. Microblogging</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Mastodon</a></li>
<li><a href="#sec-5">5. Recent Influx</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Social Media</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Why do people use it (Top 10 from Pew)</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>To stay in touch with what friends are doing (42%)
</li>
<li>To stay up-to-date with news and current events (41%)
</li>
<li>To fill up spare time (39%)
</li>
<li>To find funny or entertaining content (37%)
</li>
<li>General networking with other people (34%)
</li>
<li>Because friends are already on them (33%)
</li>
<li>To share photos or videos with others (32%)
</li>
<li>To share my opinion (30%)
</li>
<li>To research new products to buy (29%)
</li>
<li>To meet new people (27%)
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Why people avoid it</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Find it a time waste. 
</li>
<li>Don't want to take the time to learn how.
</li>
<li>Not intertested in it. 
</li>
<li>Don't see any value in it.
</li>
<li>Concerned about their information/identity getting out.
</li>
<li>Privacy and advertising concerns. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Why do businesses use it</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Gaining traffic
</li>
<li>Interacting with your customers
</li>
<li>Increased sales
</li>
<li>Reputation management
</li>
<li>Marketing research
</li>
<li>Inexpensive
</li>
<li>The reach is global
</li>
<li>Save on advertising
</li>
<li>2.82 Billion people worldwide on social media
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Silos</h2>
<div class="outline-text-2" id="text-2">
<p>
The silos are centralized monolithic servers that control all the data,  
identities, and access.  
</p>
<ul class="org-ul">
<li>Facebook
</li>
<li>YouTube
</li>
<li>Instagram
</li>
<li>Twitter
</li>
<li>Google+
</li>
<li>Instagram
</li>
<li>Tumblr
</li>
<li>Pintrest
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Federated Alternatives</h2>
<div class="outline-text-2" id="text-3">
<p>
The fediverse is a collection of federated applications that use common  
protocols and decentralized servers. They are made up of free and open  
source software. I will be focusing mainly on Mastodon.
</p>

<ul class="org-ul">
<li>Mastodon
</li>
<li>Pleroma
</li>
<li>GNU Social
</li>
<li>Gab
</li>
<li>Pixelfed
</li>
<li>PeerPx
</li>
<li>Peertube
</li>
<li>Funkwhale
</li>
<li>Friendica
</li>
<li>Diaspora
</li>
<li>Hubzilla
</li>
<li>Nextcloud
</li>
<li>Plume
</li>
<li>WriteFreely
</li>
<li>MissKey
</li>
<li>And many more every day
</li>
</ul>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Protocols</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt> ActivityPub </dt><dd>   This is the key to Mastodon and most of the current servers. This is why  
the are all able to federate together. Possibly the last good thing to 
come out of W3C before their anit-piracy controversy.  
</dd>
<dt> OStatus </dt><dd>   This was the beginning and got GNUSocial off the ground. But after the  
wide adoption of AvtivityPub only Friendica and GNU Social still support  
this.
</dd>
<dt> DFRN </dt><dd>   Distributed Friends and Relations Network protocol. Supported by 
Friendica but I am not sure of another. 
</dd>
<dt> Diaspora Network </dt><dd>   This protocol is supported by Diaspora and Friendica. 
</dd>
<dt> XMPP </dt><dd>   This is messaging protocol. It is also federated and distributed. There  
is no big central authority, and you can run your own server. Everyone  
gets their own JID and with "transports" can even intereact between  
non XMPP servers.
</dd>
<dt> Zot &amp; Zot6 </dt><dd>   This is used in Hubzilla. Communications are excrypted at both ends.
</dd>
<dt> Atom, Activity Streams, WebSub, Salmon, and WebFinger </dt><dd>   These where the start of many of these protocols. They choose to be  
able to connect to these open protocols for social networking.   
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Microblogging</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Most people know what blogging is. A blog site resembles a periodical magazine  
in that a specific topic or even a stream of consciousness it explored by an  
author and published daily, weekly, monthly, or perhaps with a little less  
disciplined schedule. Then there is Microblogging. This is what is most  
associated with Twitter. Short messages (originally 140 characters or less)  
are published in short periods of time sometimes many multiple times per day.  
The author may have an audience, like our current President. Or perhaps hopes  
to establish an audience of followers that engage such small blogs with  
reactive commentary, republishing, and sharing. Or by simply upvoting them.  
Twitter has shown this to be an effecive medium, and many people have bought  
into it either as consumers or content creators. As such, content creators  
have become influencers and even derived income from companies wanting them  
to mention, use, or otherwise display their wares. And to paraphrase the 
famous  George and Ira Gershwin "It's nice work if you can it!"
</p>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Mastodon</h2>
<div class="outline-text-2" id="text-4">
<p>
Because Mastadon uses ActivityPub any other server that uses it can share data  
like toots or whatever each of them calls their posts. For instance, I an share  
a video on PeerTube, share and boost and comment on it from Mastadon and others  
who don't even have an account on PeerTube can see it, comment on it, follow it,  
and share it.  
</p>

<p>
Think of federation in the way you do eMail. You may have an account on Gmail..
and I have an account on HoTMaiL, and yet another person may have an account on  
their work's privately run Exchange server. But sending and receiving email between  
us is straight forward and we don't need accounts on each other's servers. 
</p>

<p>
Visually, to the end user, Mastodon looks like Twitter, or more specifically an  
interface called TweetDeck. However, it doesn't have to look that way, you can  
even use certain IRC clients to access your accounts.  
</p>

<p>
Most interfaces however, seem to be multicolumn and I will describe this based on  
the ones I have worked with.  
</p>

<p>
To start with, because Mastodon is a big furry elephant like thing rather than a  
bird, posts made are called "toots". I will pause while you snicker. If you choose  
to befriend someone you "follow" them. Where you connect is called an "instance".  
If you like someone's toot that is called a boost, which will cause it to be  
reposted to everyone who considers you a friend (your followers). 
</p>

<p>
Instances can and are run by anyone. One of the servers called "Pleroma" is made  
specifically to be lightweight enough that you can install it on a RaspberryPi.  
This is the major difference between the Fediverse and the Silos. Everyone  
can run their own instance if they choose to, or they can connect through free  
ones setup and maintained by other. A company could setup an instance for their  
employees only. A family can setup and instance for their own use. A club could  
be formed and charge membership. And they are so cheap and easy to setup and run  
no one "needs" to monetize. You can be a member on one or more instance, and  
if you want, you can move all your data from one instance to another. Instances  
tend to have a theme or general common interest. So you pick one that fits your  
interests.  
</p>

<p>
Normally there are 3 main columns or views. Home, local, and federated view. The  
home view contains all the toots from everyone you "follow" regardless of their  
instance. In addition to that, if someone you follow boosts a toot you will see  
that too. In the local view are all the toots from everyone on your instance.  
Of course, and any toot any of them have choosen to boost. Then comes the  
Federated view. Care to take a guess? Everyone on your instance, everyone they  
follow and everyone they follow etc. toots, and boosts. 
</p>

<p>
Federation happens, because once their is at least one person following another  
on a different instance, now the instances federate because of it. 
</p>

<p>
On the silos, someone you don't really know based on information you are not privy  
to makes decisions about what you can and can't see, say, and in what order you  
get to do so. You timelines are dictated by by algorithm and you are shown those  
things they have determined will generate them the most revenue by exposing you to  
advertisements.  Their business model dictates this. They are large with large  
servers that need large groups of maintainers with large salaries.
</p>

<p>
In the fediverse the low cost to run an instance allows people to do it without vast  
need to get income from it. Some people use things like Patreon and their open  
source alternatives like Liberapay.  
</p>

<p>
You can currate your views by blocking, or muting anyone you choose not to hear from  
for any reason you like. You can block a particular conversation you are in. You can  
even block or mute whole instances.  
</p>

<p>
Interestingly enough an instance can do the same thing. An instance can set rules as  
to what is acceptable speech, topics, and behaviors as well as what the repricussions  
for such infractions are. This may cause some controversy, but the ability to simply  
take all your data and move to another instance or create your own should negate any  
issue this causes. 
</p>

<p>
If you are interested there are instance finders, node lists and other helpful  
sites that you can start with. 
</p>
<dl class="org-dl">
<dt> Lets you pick an instnace from some criteria </dt><dd><a href="https://joinmastodon.org/">https://joinmastodon.org/</a> 
</dd>
<dt> Quickstart, choose lanugage and some criteria </dt><dd><a href="https://instances.social/">https://instances.social/</a>
</dd>
<dt> Blog about software changes and general info </dt><dd><a href="https://blog.joinmastodon.org/">https://blog.joinmastodon.org/</a>  
</dd>
<dt> Place where you can follow people with similar interests </dt><dd><a href="https://communitywiki.org/trunk/">https://communitywiki.org/trunk/</a>
</dd>
<dt> How to setup a Mastodon instance </dt><dd><a href="https://tinyurl.com/y7bcwldf">https://tinyurl.com/y7bcwldf</a> 
</dd>
<dt> How to setup a Pleroma instance  </dt><dd><a href="https://tinyurl.com/wtr3wrw">https://tinyurl.com/wtr3wrw</a>
</dd>
<dt> News about the Fediverse and links and information on different services </dt><dd><a href="https://fediverse.party/">https://fediverse.party/</a>
</dd>
<dt> Emacs interface into Mastodon </dt><dd><a href="https://github.com/jdenen/mastodon.el">https://github.com/jdenen/mastodon.el</a>
</dd>
<dt> Vim interface into Mastodon </dt><dd><a href="https://github.com/mattn/vim-mastodon">https://github.com/mattn/vim-mastodon</a>
</dd>
<dt> Electron interface into Mastodon </dt><dd><a href="https://github.com/h3poteto/whalebird-desktop">https://github.com/h3poteto/whalebird-desktop</a>
</dd>
</dl>

<p>
Or if you know of a specific instance (like if a friend tells you theirs) you can  
just go to it and if they are open to new users you can join. 
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Recent Influx</h2>
<div class="outline-text-2" id="text-5">
<p>
Free Speech has been a big reason for people leaving Twitter and Tumblr for Mastadon.  
The latest big move was due to one of India's Supreme Court lawyers (Sanjay Hegde)  
having his Twitter account suspended twice. Once for an image of August Landmesser,  
refusing to perform the Nazi salute and again for a poem that protested the hanging of  
two revolutionaries. 
</p>
<dl class="org-dl">
<dt> BBC News Article </dt><dd><a href="http://tiny.cc/hvhdgz">http://tiny.cc/hvhdgz</a>
</dd>
</dl>

<p>
It is interesting that Free Speech is as common a reason for people to flock to the  
Fediverse as any other. However, the general bent of the Fediverse tends to lean more  
toward safe spaces and places to avoid abuseive treatment. There are plenty of tools  
available for moderation of both you own personal views of the network, as well as  
to those running instances to currate how those on their instance will experience it.  
This has met with some controversy in itself, as those wanting ultimate free speech  
and those who don't want to be insulted or have their beliefs challenged come to be 
at odds with one another.  This does make for some drama, but again, you are free  
to choose an instance that falls in line with your beliefs on these matters, even if  
that means you are in one that tries to be completely self contained. And if you 
find you are not happy where you are, you can move all your data, and everything to  
another instance. The tools are there that make it simple. 
</p>

<dl class="org-dl">
<dt> My Links </dt><dd><a href="http://bradleysmall.com/">http://bradleysmall.com/</a>
</dd>
<dt> Read More </dt><dd><a href="https://wiki.freedombone.net/">https://wiki.freedombone.net/</a>
</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Bradley Small</p>
<p class="date">Created: 2019-11-19 Tue 11:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
